app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("Name", "Phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Name", "Mohamed"], ["Phone", 2022804456], ["created_at", Tue, 10 Dec 2013 02:32:27 UTC +00:00], ["updated_at", Tue, 10 Dec 2013 02:32:27 UTC +00:00]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "Phone" = ?, "updated_at" = ? WHERE "contacts"."id" = 3  [["Phone", 2230883372], ["updated_at", Tue, 10 Dec 2013 02:33:18 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)